// Это комментарий, и он будет проигнорирован компилятором
// Вы можете протестировать этот код, нажав кнопку "Run" прямо тут ->
// или если вы предпочитаете использовать свою клавиатуру, вы можете использовать горячую клавишу "Ctrl + Enter"

// Этот код редактируемый, можете свободно хакать!
// Вы всегда можете вернуться к оригинальному коду, нажав на кнопку "Reset" ->

// Это основная функция
fn main() {
	// Находящиеся здесь инструкции будут выполнены при запуске скомпилированной программы

    // Вывести текст в консоль
    println!("Hello World!");
}
